In [4]:
import numpy as np
import pandas as pd

In [9]:
df=pd.read_csv("smaller_adult.csv")
df

,age,workclass,educational-num,occupation,gender,hours-per-week,income
0,25,Private,7,Machine-op-inspct,Male,40,<=50K
1,38,Private,9,Farming-fishing,Male,50,<=50K
2,28,Local-gov,12,Protective-serv,Male,40,>50K
3,44,Private,10,Machine-op-inspct,Male,40,>50K
4,18,?,10,?,Female,30,<=50K
...,...,...,...,...,...,...,...
3569,49,?,9,?,Female,40,<=50K
3570,29,Private,11,Prof-specialty,Male,40,>50K
3571,25,Private,9,Craft-repair,Male,50,<=50K
3572,47,Private,9,Exec-managerial,Female,50,>50K
3573,44,Self-emp-not-inc,13,Sales,Female,60,>50K

In [10]:
df.isin(['?']).sum()

age                  0
workclass          214
educational-num      0
occupation         214
gender               0
hours-per-week       0
income               0
dtype: int64

In [11]:
df.columns

Index(['age', 'workclass', 'educational-num', 'occupation', 'gender',
       'hours-per-week', 'income'],
      dtype='object')

In [12]:
#Replace ? with NaN
df['workclass'] = df['workclass'].replace('?', np.nan)
df['occupation'] = df['occupation'].replace('?', np.nan)

In [14]:
df.dropna(how='any', inplace=True)
df

,age,workclass,educational-num,occupation,gender,hours-per-week,income
0,25,Private,7,Machine-op-inspct,Male,40,<=50K
1,38,Private,9,Farming-fishing,Male,50,<=50K
2,28,Local-gov,12,Protective-serv,Male,40,>50K
3,44,Private,10,Machine-op-inspct,Male,40,>50K
5,34,Private,6,Other-service,Male,30,<=50K
...,...,...,...,...,...,...,...
3568,56,Private,3,Machine-op-inspct,Male,40,>50K
3570,29,Private,11,Prof-specialty,Male,40,>50K
3571,25,Private,9,Craft-repair,Male,50,<=50K
3572,47,Private,9,Exec-managerial,Female,50,>50K
3573,44,Self-emp-not-inc,13,Sales,Female,60,>50K

In [15]:
print(f"There are {df.duplicated().sum()} duplicate values")

There are 238 duplicate values

In [16]:
df = df.drop_duplicates()
df.shape

(3122, 7)

In [17]:
df.columns

Index(['age', 'workclass', 'educational-num', 'occupation', 'gender',
       'hours-per-week', 'income'],
      dtype='object')

In [24]:
X = df.loc[:,['age', 'workclass', 'educational-num', 'occupation', 'gender', 'hours-per-week']]
y = df.loc[:,'income']
print(f"{X}  {y}")

      age         workclass  educational-num         occupation  gender  \
0      25           Private                7  Machine-op-inspct    Male
1      38           Private                9    Farming-fishing    Male
2      28         Local-gov               12    Protective-serv    Male
3      44           Private               10  Machine-op-inspct    Male
5      34           Private                6      Other-service    Male
...   ...               ...              ...                ...     ...
3568   56           Private                3  Machine-op-inspct    Male
3570   29           Private               11     Prof-specialty    Male
3571   25           Private                9       Craft-repair    Male
3572   47           Private                9    Exec-managerial  Female
3573   44  Self-emp-not-inc               13              Sales  Female

      hours-per-week
0                 40
1                 50
2                 40
3                 40
5                 30
...              ...
3568              40
3570              40
3571              50
3572              50
3573              60

[3122 rows x 6 columns]  0       <=50K
1       <=50K
2        >50K
3        >50K
5       <=50K
        ...
3568     >50K
3570     >50K
3571    <=50K
3572     >50K
3573     >50K
Name: income, Length: 3122, dtype: object

In [29]:
from sklearn.preprocessing import LabelEncoder
y = LabelEncoder().fit_transform(y)
y = pd.DataFrame(y)
y.head()

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)

   0
0  0
1  0
2  1
3  1
4  0

In [30]:
#First identify caterogical features and numeric features
numeric_features = X.select_dtypes('number')
categorical_features = X.select_dtypes('object')
categorical_features

             workclass         occupation  gender
0              Private  Machine-op-inspct    Male
1              Private    Farming-fishing    Male
2            Local-gov    Protective-serv    Male
3              Private  Machine-op-inspct    Male
5              Private      Other-service    Male
...                ...                ...     ...
3568           Private  Machine-op-inspct    Male
3570           Private     Prof-specialty    Male
3571           Private       Craft-repair    Male
3572           Private    Exec-managerial  Female
3573  Self-emp-not-inc              Sales  Female

[3122 rows x 3 columns]

In [31]:
#Convert categorical features into numeric
converted_categorical_features = pd.get_dummies(categorical_features)
converted_categorical_features.shape

(3122, 23)

In [32]:
#combine the converted categorical features and the numeric features together into a new dataframe called "newX"
all_features = [converted_categorical_features, numeric_features]
newX = pd.concat(all_features,axis=1, join='inner')
newX.shape

(3122, 26)

In [35]:
newX.columns

Index(['workclass_Federal-gov', 'workclass_Local-gov', 'workclass_Private',
       'workclass_Self-emp-inc', 'workclass_Self-emp-not-inc',
       'workclass_State-gov', 'workclass_Without-pay',
       'occupation_Adm-clerical', 'occupation_Armed-Forces',
       'occupation_Craft-repair', 'occupation_Exec-managerial',
       'occupation_Farming-fishing', 'occupation_Handlers-cleaners',
       'occupation_Machine-op-inspct', 'occupation_Other-service',
       'occupation_Priv-house-serv', 'occupation_Prof-specialty',
       'occupation_Protective-serv', 'occupation_Sales',
       'occupation_Tech-support', 'occupation_Transport-moving',
       'gender_Female', 'gender_Male', 'age', 'educational-num',
       'hours-per-week'],
      dtype='object')

In [36]:
#Do a train test split
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(newX, y, test_size=0.33, random_state=42)

In [37]:
from sklearn.svm import SVC
clf = SVC(kernel="linear", gamma = 'auto')
clf.fit(X_train, y_train.values.ravel())

SVC(gamma='auto', kernel='linear')

In [39]:
SVC(gamma='auto',kernel='linear')

SVC(gamma='auto', kernel='linear')

In [41]:
# Make predictions
y_pred = clf.predict(X_test)
y_pred

array([0, 0, 0, ..., 0, 0, 0], dtype=int64)

In [42]:
predictions_df = pd.DataFrame()
predictions_df['precdicted_salary_class'] = y_pred
predictions_df['actual_salary_class'] = y_test[0].values
predictions_df

      precdicted_salary_class  actual_salary_class
0                           0                    0
1                           0                    1
2                           0                    0
3                           0                    0
4                           0                    0
...                       ...                  ...
1026                        1                    1
1027                        0                    0
1028                        0                    0
1029                        0                    0
1030                        0                    0

[1031 rows x 2 columns]

In [43]:
#Evaluate the performance of fitting
from sklearn.metrics import accuracy_score
print(accuracy_score(y_pred,y_test))

0.7672162948593598